---
kind: enumMember
id: F:Autodesk.Revit.DB.ColumnAttachmentJustification.Tangent
enum: Autodesk.Revit.DB.ColumnAttachmentJustification
source: html/39a5a31b-dc66-8db0-1f12-07c22e3bac09.htm
---
# Autodesk.Revit.DB.ColumnAttachmentJustification.Tangent

For slanted columns only. Extend the column until its driving curve contacts the target, then cut the column
 with a plane tangent to the target at that contact point.